Autodesk.Revit.DB.FailureSeverity
Enum represents severity of a failure.
Since:
2011

Autodesk.Revit.DB.FailureSeverity.DocumentCorruption
Failure that forces Transaction to be rolled back as soon as possible due to known corruption to a document.
When failure of this severity is posted, reading of information from a document is not allowed.
The current transaction has to be rolled back first in order to work with the document.

Autodesk.Revit.DB.FailureSeverity.Error
Failure that cannot be ignored.
If FailureMeassage of this severity is posted, the current transaction cannot be committed unless
failure is resolved via appropriate FailureResolution.

Autodesk.Revit.DB.FailureSeverity.Warning
Failure that can be ignored by end-user. Failures of this severity do not prevent transactions from being committed.

Autodesk.Revit.DB.FailureSeverity.None
Represents a failure-free state of a document. This value cannot be used as an argument to construct FailureMesasage.